# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [1]:
# Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [2]:
# Your code here
cur.execute("""SELECT lastName, firstName FROM employees JOIN offices USING (officeCode) WHERE city = 'Boston' LIMIT 5;""")
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [3]:
cur.execute("""SELECT offices.officeCode, offices.city, COUNT(employees.employeeNumber) AS n_employees
               FROM offices 
               LEFT JOIN employees
               USING(officeCode)
               GROUP BY officeCode
               HAVING n_employees = 0;""")
df2 = pd.DataFrame(cur.fetchall())
df2.columns = [i[0] for i in cur.description]
df2

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [6]:
# Your code here
cur.execute("""
SELECT products.productName, employees.lastName, employees.firstName
FROM employees
JOIN customers
ON customers.salesRepEmployeeNumber = employees.employeeNumber
JOIN orders
ON customers.customerNumber = orders.customerNumber
JOIN orderdetails
ON orders.orderNumber = orderdetails.orderNumber
JOIN products
ON orderdetails.productCode = products.productCode
""")

df3 = pd.DataFrame(cur.fetchall())
df3.columns = [x[0] for x in cur.description]
df3.head()

                                   productName  lastName firstName
0                               1958 Setra Bus  Jennings    Leslie
1                       1940 Ford Pickup Truck  Jennings    Leslie
2                      1939 Cadillac Limousine  Jennings    Leslie
3  1996 Peterbilt 379 Stake Bed with Outrigger  Jennings    Leslie
4                            1968 Ford Mustang  Jennings    Leslie

## Level Up: Display the Number of Products each employee has sold

In [11]:
# Your code here
cur.execute("""
SELECT employees.lastName, employees.firstName,
COUNT(products.productCode) AS total_products
FROM employees
JOIN customers
ON customers.salesRepEmployeeNumber = employees.employeeNumber
JOIN orders
ON customers.customerNumber = orders.customerNumber
JOIN orderdetails
ON orders.orderNumber = orderdetails.orderNumber
JOIN products
ON orderdetails.productCode = products.productCode
GROUP BY employees.lastName
ORDER BY total_products DESC
""")

df4 = pd.DataFrame(cur.fetchall())
df4.columns = [x[0] for x in cur.description]
df4

     lastName firstName  total_products
0   Hernandez    Gerard             396
1    Jennings    Leslie             331
2    Castillo    Pamela             272
3        Bott     Larry             236
4       Jones     Barry             220
5      Vanauf    George             211
6      Fixter      Andy             185
7       Marsh     Peter             185
8      Bondur      Loui             177
9   Patterson     Steve             152
10      Tseng  Foon Yue             142
11      Nishi      Mami             137
12   Firrelli     Julie             124
13     Gerard    Martin             114
14   Thompson    Leslie             114

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!